import numpy as np

In [10]:
np.random.seed(22)

a = np.random.randint(1,20,5)
a

array([ 5, 13,  1,  5,  7])

# Pandas

#### Pandas= open source library that is used to handle data manipulations.

## Data structure of pandas

1. Series ===> it is used for one dimensional data. It shows only values of a coloumn and it will not include coloumn name.
2. DataFrame ===> It is multi-dimensional data. It shows column name with values.

In [16]:
import pandas as pd

## (1). Series

In [14]:
a = pd.Series([1,34,78,90])
a

0     1
1    34
2    78
3    90
dtype: int64

In [15]:
type(a)

pandas.core.series.Series

## (2). DataFrame

In [4]:
a = {
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['Sam', 'Rahhul', 'Gorav', 'Aniket', 'Anjali', 'Riya', 'Muskan', 'Harsh'],
    "Department" : ['IT', 'HR', 'Sales', 'IT', 'IT', 'IT', 'Sales', 'IT'],
    "Salary" : [25000, 27000, 23000, 38000, 35000, 32000, 28000, 31000],
    "Working_Hours": [8,9,8,9,7,6,7,8]
}
a

{'Emp_ID': [1, 2, 3, 4, 5, 6, 7, 8],
 'Name': ['Sam',
  'Rahhul',
  'Gorav',
  'Aniket',
  'Anjali',
  'Riya',
  'Muskan',
  'Harsh'],
 'Department': ['IT', 'HR', 'Sales', 'IT', 'IT', 'IT', 'Sales', 'IT'],
 'Salary': [25000, 27000, 23000, 38000, 35000, 32000, 28000, 31000],
 'Working_Hours': [8, 9, 8, 9, 7, 6, 7, 8]}

In [5]:
type(a)

dict

In [12]:
import pandas as pd

df = pd.DataFrame(a)
df

   Emp_ID    Name Department  Salary  Working_Hours
0       1     Sam         IT   25000              8
1       2  Rahhul         HR   27000              9
2       3   Gorav      Sales   23000              8
3       4  Aniket         IT   38000              9
4       5  Anjali         IT   35000              7
5       6    Riya         IT   32000              6
6       7  Muskan      Sales   28000              7
7       8   Harsh         IT   31000              8

## How to check top 5 data from a dataset?

In [13]:
df.head()

   Emp_ID    Name Department  Salary  Working_Hours
0       1     Sam         IT   25000              8
1       2  Rahhul         HR   27000              9
2       3   Gorav      Sales   23000              8
3       4  Aniket         IT   38000              9
4       5  Anjali         IT   35000              7

In [17]:
df.head(2)

   Emp_ID    Name Department  Salary  Working_Hours
0       1     Sam         IT   25000              8
1       2  Rahhul         HR   27000              9

## How to check bottom data?

In [15]:
df.tail()

   Emp_ID    Name Department  Salary  Working_Hours
3       4  Aniket         IT   38000              9
4       5  Anjali         IT   35000              7
5       6    Riya         IT   32000              6
6       7  Muskan      Sales   28000              7
7       8   Harsh         IT   31000              8

In [16]:
df.tail(2)

   Emp_ID    Name Department  Salary  Working_Hours
6       7  Muskan      Sales   28000              7
7       8   Harsh         IT   31000              8

## How can we check random indexed data?

In [19]:
df.sample(5)

   Emp_ID    Name Department  Salary  Working_Hours
4       5  Anjali         IT   35000              7
2       3   Gorav      Sales   23000              8
6       7  Muskan      Sales   28000              7
1       2  Rahhul         HR   27000              9
0       1     Sam         IT   25000              8

## How to export our data?

In [21]:
df.to_csv("D:\\RegexSolution\\Python\\AdvancePython\\Import\\Emp_Info.csv")

In [ ]:
# Step 1 => (df to_csv(" "))
# step 2 => Create a new folder ==> copy location ==> paste it into step1
# df.to_csv("folder_location\\filename.csv")

In [ ]:
#instant data scrapper ==> data from live site, example-> Flipkart